# Pandas - our own study

What we were supposed to read: https://pandas.pydata.org/pandas-docs/stable/getting_started/10min.html

What I preffered to read: https://www.learndatasci.com/tutorials/python-pandas-tutorial-complete-introduction-for-beginners/

In [2]:
import pandas as pd
import numpy as np

The primary two components of pandas are the Series and DataFrame.

A Series is essentially a column
DataFrame is a multi-dimensional table made up of a collection of Series.

## Creating DataFrames
### Creating DataFrames from scratch

In [7]:
# 
# There are many ways to create a DataFrame from scratch, but a great option is to just use a simple dict.

data = {'apples' : [3, 2, 0, 1], 'oranges' : [0, 3, 7, 2]}
data

{'apples': [3, 2, 0, 1], 'oranges': [0, 3, 7, 2]}

In [8]:
# And then pass it to the pandas DataFrame constructor:

purchases = pd.DataFrame(data)
purchases

   apples  oranges
0       3        0
1       2        3
2       0        7
3       1        2

In [10]:
purchases = pd.DataFrame(data, index=['June', 'Robert', 'Lily', 'David'])
purchases

        apples  oranges
June         3        0
Robert       2        3
Lily         0        7
David        1        2

In [11]:
purchases.loc['June']

apples     3
oranges    0
Name: June, dtype: int64

### Reading data from CSVs

In [16]:
df = pd.read_csv('titanic.csv')
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S